[Killed] PublicVisibility
Application/Service/SendMail/EmailSender.php:31:5
         $this->emailApi = $emailApi;
     }
 
-    public function isAuthenticated(string $user): ResponseIsAuth
+    protected function isAuthenticated(string $user): ResponseIsAuth
     {
         $this->user = $user;
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:57
.

ERRORS!
Tests: 3, Assertions: 2, Errors: 1, Failures: 1.

[Killed] PublicVisibility
Application/Service/SendMail/EmailSender.php:37:5
         return new ResponseIsAuth($this->user);
     }
 
-    public function sendMail(RequestEmailSender $request): array
+    protected function sendMail(RequestEmailSender $request): array
     {
         if (isset($this->user)) {
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailAuthFailure
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:47
.

ERRORS!
Tests: 2, Assertions: 1, Errors: 1, Failures: 1.

[Killed] Throw_
Application/Service/SendMail/EmailSender.php:45:17
             try {
                 return $this->emailApi->sendEmail($emailData);
             } catch (ErrorMailSenderException $e) {
-                throw new ErrorMailSenderException(self::ERROR_SENDING, self::HTTP_ERROR_500, $e);
+                new ErrorMailSenderException(self::ERROR_SENDING, self::HTTP_ERROR_500, $e);
             }
         }
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "EmailSender\Application\Service\SendMail\Exceptions\ErrorAuthException" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Utilisateur non authentifié" at
/home/dev/work/emailsender/src/Application/Service/Send

[Killed] Throw_
Application/Service/SendMail/EmailSender.php:49:9
             }
         }
 
-        throw new ErrorAuthException(self::ERROR_AUTH, self::HTTP_ERROR_401);
+        new ErrorAuthException(self::ERROR_AUTH, self::HTTP_ERROR_401);
     }
 
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailAuthFailure
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailAuthFailure
Failed asserting that exception of type "TypeError" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorAuthException". Message was: "EmailSender\Application\Service\SendMail\EmailSender::sendMail(): Return value must be of type array, none returned" at
/home/dev/work/emailsender/src/Applic

[Killed] PublicVisibility
Application/Service/SendMail/EmailSender.php:52:5
         throw new ErrorAuthException(self::ERROR_AUTH, self::HTTP_ERROR_401);
     }
 
-    public function contentEmailData(RequestEmailSender $request): array
+    protected function contentEmailData(RequestEmailSender $request): array
     {
         return [
killedBy: EmailSender\Tests\EmailSenderTest::testContentEmailData
statusReason: 1) EmailSender\Tests\EmailSenderTest::testContentEmailData
Error: Call to protected method EmailSender\Application\Service\SendMail\EmailSender::contentEmailData() from scope EmailSender\Tests\EmailSenderTest

/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:75

2) EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailSuccess
Error: Call to prot
