[Killed] LogicalNot
Domain/Contact.php:15:9
     public function __construct(string $name, string $address)
     {
 
-        if (!$this->isValidEmailAddress($address)) {
+        if ($this->isValidEmailAddress($address)) {
             throw new MalformedAddressException("Invalid email address: $address");
         }
killedBy: EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailSuccess
statusReason: 1) EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailSuccess
EmailSender\Application\Service\SendMail\Exceptions\MalformedAddressException: Invalid email address: sender@example.com

/home/dev/work/emailsender/src/Domain/Contact.php:13
/home/dev/work/emailsender/tests/unit/Infrastructure/Brevo/BrevoSenderTest.php:35

2) EmailSender\Tests\EmailSenderTest::testContentEmailData
Ema

[Survived] Throw_
Domain/Contact.php:16:13
     {
 
         if (!$this->isValidEmailAddress($address)) {
-            throw new MalformedAddressException("Invalid email address: $address");
+            new MalformedAddressException("Invalid email address: {$address}");
         }
 
