[Survived] ArrayItemRemoval
Domain/Mail.php:36:9
      */
     public function getSenderData(): array
     {
-        return ['name' => $this->getSenderName(), 'email' => $this->getSenderAddress()];
+        return ['email' => $this->getSenderAddress()];
     }
 

[Killed] PublicVisibility
Domain/Mail.php:39:5
         return ['name' => $this->getSenderName(), 'email' => $this->getSenderAddress()];
     }
 
-    public function getRecipientName(): string
+    protected function getRecipientName(): string
     {
         return $this->recipient->getRecipientName(0);
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getRecipientName() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:28

ERRORS!
Tests: 7, Assertions: 10, Errors: 1.

[Killed] DecrementInteger
Domain/Mail.php:41:9
 
     public function getRecipientName(): string
     {
-        return $this->recipient->getRecipientName(0);
+        return $this->recipient->getRecipientName(-1);
     }
 
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "Error" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Call to a member function getName() on null" at
/home/dev/work/emailsender/src/Domain/Recipient.php:16
/home/dev/work/emailsender/src/Domain/Mail.php:31

[Killed] IncrementInteger
Domain/Mail.php:41:9
 
     public function getRecipientName(): string
     {
-        return $this->recipient->getRecipientName(0);
+        return $this->recipient->getRecipientName(1);
     }
 
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "Error" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Call to a member function getName() on null" at
/home/dev/work/emailsender/src/Domain/Recipient.php:16
/home/dev/work/emailsender/src/Domain/Mail.php:31

[Killed] PublicVisibility
Domain/Mail.php:44:5
         return $this->recipient->getRecipientName(0);
     }
 
-    public function getRecipientAddress(): string
+    protected function getRecipientAddress(): string
     {
         return $this->recipient->getRecipientAddress(0);
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getRecipientAddress() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:29

ERRORS!
Tests: 7, Assertions: 11, Errors: 1.

[Killed] DecrementInteger
Domain/Mail.php:46:9
 
     public function getRecipientAddress(): string
     {
-        return $this->recipient->getRecipientAddress(0);
+        return $this->recipient->getRecipientAddress(-1);
     }
 
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "Error" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Call to a member function getAddress() on null" at
/home/dev/work/emailsender/src/Domain/Recipient.php:21
/home/dev/work/emailsender/src/Domain/Mail.php

[Killed] IncrementInteger
Domain/Mail.php:46:9
 
     public function getRecipientAddress(): string
     {
-        return $this->recipient->getRecipientAddress(0);
+        return $this->recipient->getRecipientAddress(1);
     }
 
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "Error" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Call to a member function getAddress() on null" at
/home/dev/work/emailsender/src/Domain/Recipient.php:21
/home/dev/work/emailsender/src/Domain/Mail.php

[Killed] PublicVisibility
Domain/Mail.php:52:5
     /**
      * @return array<string, string>
      */
-    public function getRecipientData(): array
+    protected function getRecipientData(): array
     {
         return ['name' => $this->getRecipientName(), 'email' => $this->getRecipientAddress()];
killedBy: EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
/home/dev/work/emailsender/src/Application/Service/SendMail/EmailSender.php:57
/home/dev/work/emailsender/src/Application/Service/SendMail/EmailSender.php:40
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:58
.

ERRORS!

[Survived] ArrayItem
Domain/Mail.php:54:9
      */
     public function getRecipientData(): array
     {
-        return ['name' => $this->getRecipientName(), 'email' => $this->getRecipientAddress()];
+        return ['name' => $this->getRecipientName(), 'email' > $this->getRecipientAddress()];
     }
 
