[Killed] PublicVisibility
Domain/Recipient.php:14:5
     {
     }
 
-    public function getRecipientName(int $rang): string
+    protected function getRecipientName(int $rang): string
     {
         return $this->recipient[$rang]->getName();
killedBy: EmailSender\Tests\Domain\RecipientTest::testRecipient
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "Error" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Call to protected method EmailSender\Domain\Recipient::getRecipientName() from scope EmailSender\Domain\Mail" at
/home/dev/work/emailsender/src/Domain/M

[Killed] PublicVisibility
Domain/Recipient.php:19:5
         return $this->recipient[$rang]->getName();
     }
 
-    public function getRecipientAddress(int $rang): string
+    protected function getRecipientAddress(int $rang): string
     {
         return $this->recipient[$rang]->getAddress();
killedBy: EmailSender\Tests\Domain\RecipientTest::testRecipient
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSendingFailure
Failed asserting that exception of type "Error" matches expected exception "EmailSender\Application\Service\SendMail\Exceptions\ErrorMailSenderException". Message was: "Call to protected method EmailSender\Domain\Recipient::getRecipientAddress() from scope EmailSender\Domain\Mail" at
/home/dev/work/emailsender/src/Domai
