[Survived] FunctionCallRemoval
Infrastructure/Brevo/BrevoSender.php:29:9
 
     public function sendEmail(array $emailData): array
     {
-        var_dump($emailData);
+        
         $sendSmtpEmail = new SendSmtpEmail($emailData);
 

[Killed] ArrayItemRemoval
Infrastructure/Brevo/BrevoSender.php:34:13
 
         try {
             $response = $this->apiInstance->sendTransacEmail($sendSmtpEmail);
-            return ['messageId' => $response->getMessageId()];
+            return [];
         } catch (Exception $e) {
             throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", 500, $e);
killedBy: EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailSuccess
statusReason: 1) EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailSuccess
Failed asserting that two arrays are equal.
--- Expected
+++ Actual
@@ @@
 Array (
-    'messageId' => '1234'
 )

[Killed] Throw_
Infrastructure/Brevo/BrevoSender.php:36:13
             $response = $this->apiInstance->sendTransacEmail($sendSmtpEmail);
             return ['messageId' => $response->getMessageId()];
         } catch (Exception $e) {
-            throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", 500, $e);
+            new ErrorMailSenderException("Erreur lors de l'envoi du mail", 500, $e);
         }
     }
killedBy: EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailFailure
statusReason: 1) EmailSender\Tests\Infrastructure\Brevo\BrevoSenderTest::testSendEmailFailure
Failed asserting that exception of type "TypeError" matches expected exception "Exception". Message was: "EmailSender\Infrastructure\Brevo\BrevoSender::sendEmail(): Return value must be of type array, none returned" at
/home/dev/work/emailsender/src/Infrastructure/Brevo/BrevoSender.php:33
/home/dev/work/emailsender/tes

[Survived] IncrementInteger
Infrastructure/Brevo/BrevoSender.php:36:13
             $response = $this->apiInstance->sendTransacEmail($sendSmtpEmail);
             return ['messageId' => $response->getMessageId()];
         } catch (Exception $e) {
-            throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", 500, $e);
+            throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", 501, $e);
         }
     }
