[Killed] PublicVisibility
Application/Service/SendMail/EmailSender.php:19:5
     {
     }
 
-    public function execute(RequestEmailSender $request): void
+    protected function execute(RequestEmailSender $request): void
     {
 
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
Error: Call to protected method EmailSender\Application\Service\SendMail\EmailSender::execute() from scope EmailSender\Tests\EmailSenderTest

/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:45

ERRORS!
Tests: 3, Assertions: 8, Errors: 1.

[Killed] Equal
Application/Service/SendMail/EmailSender.php:22:9
     public function execute(RequestEmailSender $request): void
     {
 
-        if ($request == null) {
+        if ($request != null) {
             throw new \InvalidArgumentException("Request cannot be null");
         }
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
InvalidArgumentException: Request cannot be null

/home/dev/work/emailsender/src/Application/Service/SendMail/EmailSender.php:18
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:45

ERRORS!
Tests: 3, Assertions: 8, Errors: 1.

[Killed] AssignmentEqual
Application/Service/SendMail/EmailSender.php:22:9
     public function execute(RequestEmailSender $request): void
     {
 
-        if ($request == null) {
+        if ($request = null) {
             throw new \InvalidArgumentException("Request cannot be null");
         }
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
TypeError: EmailSender\Application\Service\SendMail\MailFactory::buildMailFromRequest(): Argument #1 ($request) must be of type EmailSender\Application\Service\SendMail\RequestEmailSender, null given, called in /home/dev/work/emailsender/src/Application/Service/SendMail/EmailSender.php on line 20

/home/dev/work/emailsender/sr

[NoCoverage] Throw_
Application/Service/SendMail/EmailSender.php:23:13
     {
 
         if ($request == null) {
-            throw new \InvalidArgumentException("Request cannot be null");
+            new \InvalidArgumentException("Request cannot be null");
         }
         $mail = (new MailFactory())->buildMailFromRequest($request, new MailId($this->mailId));

[Survived] MethodCallRemoval
Application/Service/SendMail/EmailSender.php:26:9
             throw new \InvalidArgumentException("Request cannot be null");
         }
         $mail = (new MailFactory())->buildMailFromRequest($request, new MailId($this->mailId));
-        $this->emailApi->sendEmail($mail);
+        
 
         $this->respository->add($mail);

[Killed] MethodCallRemoval
Application/Service/SendMail/EmailSender.php:28:9
         $mail = (new MailFactory())->buildMailFromRequest($request, new MailId($this->mailId));
         $this->emailApi->sendEmail($mail);
 
-        $this->respository->add($mail);
+        
 
         $this->response = new ResponseSendMail($mail->getMailId());
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
TypeError: EmailSender\Infrastructure\Persistance\EmailSenderRepositoryInMemory::findById(): Return value must be of type EmailSender\Domain\Mail, null returned

/home/dev/work/emailsender/src/Infrastructure/Persistance/EmailSenderRepositoryInMemory.php:21
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/Emai

[Killed] PublicVisibility
Application/Service/SendMail/EmailSender.php:33:5
         $this->response = new ResponseSendMail($mail->getMailId());
     }
 
-    public function getResponse(): ResponseSendMail
+    protected function getResponse(): ResponseSendMail
     {
         return $this->response;
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
Error: Call to protected method EmailSender\Application\Service\SendMail\EmailSender::getResponse() from scope EmailSender\Tests\EmailSenderTest

/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSenderTest.php:46

ERRORS!
Tests: 3, Assertions: 8, Errors: 1.
