[Killed] PublicVisibility
Application/Service/SendMail/MailFactory.php:18:5
 
 class MailFactory
 {
-    public function buildMailFromRequest(RequestEmailSender $request, MailId $mailId = new MailId()): Mail
+    protected function buildMailFromRequest(RequestEmailSender $request, MailId $mailId = new MailId()): Mail
     {
         return new Mail(
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
Error: Call to protected method EmailSender\Application\Service\SendMail\MailFactory::buildMailFromRequest() from scope EmailSender\Application\Service\SendMail\EmailSender

/home/dev/work/emailsender/src/Application/Service/SendMail/EmailSender.php:25
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/EmailSen

[Survived] MethodCallRemoval
Application/Service/SendMail/MailFactory.php:37:9
      */
     private function buildContact(string $sentence, string $separator): Contact
     {
-        $this->verifySeparator($separator);
+        
 
         $tab = explode($separator, $sentence);

[Killed] IncrementInteger
Application/Service/SendMail/MailFactory.php:40:9
         $this->verifySeparator($separator);
 
         $tab = explode($separator, $sentence);
-        return new Contact($tab[0], $tab[1]);
+        return new Contact($tab[1], $tab[1]);
     }
 
killedBy: EmailSender\Tests\EmailSenderTest::testMailFactory
statusReason: 1) EmailSender\Tests\EmailSenderTest::testMailFactory
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Pedro'
+'pedro@gmail.com'

[Killed] IncrementInteger
Application/Service/SendMail/MailFactory.php:40:9
         $this->verifySeparator($separator);
 
         $tab = explode($separator, $sentence);
-        return new Contact($tab[0], $tab[1]);
+        return new Contact($tab[0], $tab[2]);
     }
 
killedBy: EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
statusReason: 1) EmailSender\Tests\EmailSenderTest::testSendTransactionalEmailSuccess
TypeError: EmailSender\Domain\Contact::__construct(): Argument #2 ($address) must be of type string, null given, called in /home/dev/work/emailsender/src/Application/Service/SendMail/MailFactory.php on line 28

/home/dev/work/emailsender/src/Domain/Contact.php:13
/home/dev/work/emailsender/src/Application/Service/SendMail/Mail

[Killed] LessThan
Application/Service/SendMail/MailFactory.php:53:9
 
         /** @var array<Int, Contact> */
         $result = array();
-        for ($i = 0; $i < count($recipients); $i++) {
+        for ($i = 0; $i <= count($recipients); $i++) {
             $this->verifySeparator($separator);
             $result[$i] = $this->buildContact($recipients[$i], $separator);
killedBy: EmailSender\Tests\EmailSenderTest::testMailFactory
statusReason: 1) EmailSender\Tests\EmailSenderTest::testMailFactory
TypeError: EmailSender\Application\Service\SendMail\MailFactory::buildContact(): Argument #1 ($sentence) must be of type string, null given, called in /home/dev/work/emailsender/src/Application/Service/SendMail/MailFactory.php on line 41

/home/dev/work/emailsender/src/Application/Service/SendMail/MailFactory.php:24
/home/dev/work/emailsender/s

[Killed] LessThanNegotiation
Application/Service/SendMail/MailFactory.php:53:9
 
         /** @var array<Int, Contact> */
         $result = array();
-        for ($i = 0; $i < count($recipients); $i++) {
+        for ($i = 0; $i >= count($recipients); $i++) {
             $this->verifySeparator($separator);
             $result[$i] = $this->buildContact($recipients[$i], $separator);
killedBy: EmailSender\Tests\EmailSenderTest::testMailFactoryWithCustomId
statusReason: 1) EmailSender\Tests\EmailSenderTest::testMailFactoryWithCustomId
InvalidArgumentException: Recipients cannot be empty

/home/dev/work/emailsender/src/Domain/Recipient.php:16
/home/dev/work/emailsender/src/Application/Service/SendMail/MailFactory.php:43
/home/dev/work/emailsender/src/Application/Service/SendMail/MailFactory.php:19
/home/dev/work/emailsender/tests/unit/Application/Service/SendMail/

[Survived] MethodCallRemoval
Application/Service/SendMail/MailFactory.php:54:13
         /** @var array<Int, Contact> */
         $result = array();
         for ($i = 0; $i < count($recipients); $i++) {
-            $this->verifySeparator($separator);
+            
             $result[$i] = $this->buildContact($recipients[$i], $separator);
         }

[NoCoverage] Throw_
Application/Service/SendMail/MailFactory.php:63:13
     private function verifySeparator(string $separator): string
     {
         if (empty($separator)) {
-            throw new InvalidArgumentException("Separator cannot be empty");
+            new InvalidArgumentException("Separator cannot be empty");
         } else {
             return $separator;
