[Killed] PublicVisibility
Domain/Attachment.php:17:5
     /**
      * @return array<string, Attachment> $attachment
      */
-    public function getAttachment(): array
+    protected function getAttachment(): array
     {
         return $this->attachment;
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Attachment::getAttachment() from scope EmailSender\Domain\Mail

/home/dev/work/emailsender/src/Domain/Mail.php:70
/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:33

2) EmailSender\Tests\Domain\AttachmentTest::testAttachment
Error: Call to protected method EmailSender\Domain\Attachment::getA
