[Killed] Throw_
Domain/Contact.php:16:13
     public function __construct(string $name, string $address)
     {
         if (empty($name)) {
-            throw new InvalidArgumentException("Contact name cannot be empty");
+            new InvalidArgumentException("Contact name cannot be empty");
         }
 
killedBy: EmailSender\Tests\Domain\ContactTest::testContactNameCannotBeEmpty
statusReason: 1) EmailSender\Tests\Domain\ContactTest::testContactNameCannotBeEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 4, Assertions: 13, Failures: 1.

[Killed] Throw_
Domain/Contact.php:20:13
         }
 
         if (empty($address)) {
-            throw new InvalidArgumentException("Contact address cannot be empty");
+            new InvalidArgumentException("Contact address cannot be empty");
         }
 
killedBy: EmailSender\Tests\Domain\ContactTest::testContactAddressCannotBeEmpty
statusReason: 1) EmailSender\Tests\Domain\ContactTest::testContactAddressCannotBeEmpty
Failed asserting that exception of type "EmailSender\Application\Service\SendMail\Exceptions\MalformedAddressException" matches expected exception "InvalidArgumentException". Message was: "Invalid email address: " at
/home/dev/work/emailsender/src/Domain/Contact.php:33
/home/dev/work/emailsender/tests/unit/Domain/ContactTest.

[Killed] PublicVisibility
Domain/Contact.php:37:5
         return $this->name;
     }
 
-    public function getAddress(): string
+    protected function getAddress(): string
     {
         if (!$this->isValidEmailAddress($this->address)) {
killedBy: EmailSender\Tests\Domain\SenderTest::testSender
statusReason: 1) EmailSender\Tests\Domain\SenderTest::testSender
Error: Call to protected method EmailSender\Domain\Contact::getAddress() from scope EmailSender\Domain\Sender

/home/dev/work/emailsender/src/Domain/Sender.php:29
/home/dev/work/emailsender/tests/unit/Domain/SenderTest.php:18

2) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Contact::getAddress() fr

[Killed] LogicalNot
Domain/Contact.php:39:9
 
     public function getAddress(): string
     {
-        if (!$this->isValidEmailAddress($this->address)) {
+        if ($this->isValidEmailAddress($this->address)) {
             throw new MalformedAddressException("Invalid email address: $this->address");
         }
killedBy: EmailSender\Tests\Domain\SenderTest::testSender
statusReason: 1) EmailSender\Tests\Domain\SenderTest::testSender
EmailSender\Application\Service\SendMail\Exceptions\MalformedAddressException: Invalid email address: morgan.chemarin@logipro.com

/home/dev/work/emailsender/src/Domain/Contact.php:33
/home/dev/work/emailsender/src/Domain/Sender.php:29
/home/dev/work/emailsender/tests/unit/Domain/SenderTest.php:18

2) EmailSender\Tests\Domain\MailTest::testMail

[NoCoverage] Throw_
Domain/Contact.php:40:13
     public function getAddress(): string
     {
         if (!$this->isValidEmailAddress($this->address)) {
-            throw new MalformedAddressException("Invalid email address: $this->address");
+            new MalformedAddressException("Invalid email address: {$this->address}");
         }
         return $this->address;
