[Killed] PublicVisibility
Domain/HtmlContent.php:11:5
     {
     }
 
-    public function getHtmlContent(): string
+    protected function getHtmlContent(): string
     {
         return $this->htmlContent;
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\HtmlContent::getHtmlContent() from scope EmailSender\Domain\Mail

/home/dev/work/emailsender/src/Domain/Mail.php:62
/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:31

2) EmailSender\Tests\Domain\HtmlContentTest::testHtmlContent
Error: Call to protected method EmailSender\Domain\HtmlContent:
