[Killed] PublicVisibility
Domain/Mail.php:19:5
     ) {
     }
 
-    public function getSubject(): string
+    protected function getSubject(): string
     {
         return $this->subject->getSubject();
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getSubject() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:26

ERRORS!
Tests: 2, Assertions: 1, Errors: 1.

[Killed] PublicVisibility
Domain/Mail.php:24:5
         return $this->subject->getSubject();
     }
 
-    public function getSenderName(): string
+    protected function getSenderName(): string
     {
         return $this->sender->getSenderName();
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getSenderName() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:27

2) EmailSender\Tests\EmailSenderTest::testMailFactory
Error: Call to protected method EmailSender\Domain\Mail::getSenderName() from scope EmailSender\Tests\EmailSenderTest

[Killed] PublicVisibility
Domain/Mail.php:29:5
         return $this->sender->getSenderName();
     }
 
-    public function getSenderAddress(): string
+    protected function getSenderAddress(): string
     {
         return $this->sender->getSenderAddress();
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getSenderAddress() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:28

2) EmailSender\Tests\EmailSenderTest::testMailFactory
Error: Call to protected method EmailSender\Domain\Mail::getSenderAddress() from scope EmailSender\Tests\EmailSende

[NoCoverage] PublicVisibility
Domain/Mail.php:37:5
     /**
      * @return array<string, string>
      */
-    public function getSenderData(): array
+    protected function getSenderData(): array
     {
         return ['name' => $this->getSenderName(), 'email' => $this->getSenderAddress()];

[NoCoverage] ArrayItem
Domain/Mail.php:39:9
      */
     public function getSenderData(): array
     {
-        return ['name' => $this->getSenderName(), 'email' => $this->getSenderAddress()];
+        return ['name' => $this->getSenderName(), 'email' > $this->getSenderAddress()];
     }
 

[Killed] PublicVisibility
Domain/Mail.php:42:5
         return ['name' => $this->getSenderName(), 'email' => $this->getSenderAddress()];
     }
 
-    public function getRecipientName(int $rank): string
+    protected function getRecipientName(int $rank): string
     {
         return $this->recipient->getRecipientName($rank);
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getRecipientName() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:29

2) EmailSender\Tests\EmailSenderTest::testMailFactory
Error: Call to protected method EmailSender\Domain\Mail::getRecipientName() from scope EmailSender\Tests\EmailSende

[Killed] PublicVisibility
Domain/Mail.php:47:5
         return $this->recipient->getRecipientName($rank);
     }
 
-    public function getRecipientAddress(int $rank): string
+    protected function getRecipientAddress(int $rank): string
     {
         return $this->recipient->getRecipientAddress($rank);
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getRecipientAddress() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:30

2) EmailSender\Tests\EmailSenderTest::testMailFactory
Error: Call to protected method EmailSender\Domain\Mail::getRecipientAddress() from scope EmailSender\Tests\Emai

[NoCoverage] PublicVisibility
Domain/Mail.php:55:5
     /**
      * @return array<string, string>
      */
-    public function getRecipientData(int $rank): array
+    protected function getRecipientData(int $rank): array
     {
         return ['name' => $this->getRecipientName($rank), 'email' => $this->getRecipientAddress($rank)];

[Killed] PublicVisibility
Domain/Mail.php:73:5
         return $this->attachment->getAttachment();
     }
 
-    public function getMailId(): MailId
+    protected function getMailId(): MailId
     {
         return $this->mailId;
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Mail::getMailId() from scope EmailSender\Tests\Domain\MailTest

/home/dev/work/emailsender/tests/unit/Domain/MailTest.php:32

2) EmailSender\Tests\Domain\MailTest::testMailWithCustomId
Error: Call to protected method EmailSender\Domain\Mail::getMailId() from scope EmailSender\Tests\Domain\MailTest
