[Killed] PublicVisibility
Domain/Model/Mail/MailId.php:23:5
         return $this->id;
     }
 
-    public function equals(MailId $otherId): bool
+    protected function equals(MailId $otherId): bool
     {
         if ($this->id === $otherId->id) {
killedBy: EmailSender\Tests\Domain\Model\Mail\MailIdTest::testIdentify
statusReason: 1) EmailSender\Tests\Domain\Model\Mail\MailIdTest::testIdentify
Error: Call to protected method EmailSender\Domain\Model\Mail\MailId::equals() from scope EmailSender\Tests\Domain\Model\Mail\MailIdTest

/home/dev/work/emailsender/tests/unit/Domain/Model/Mail/MailIdTest.php:15

ERRORS!
Tests: 2, Assertions: 2, Errors: 1.

[Killed] Identical
Domain/Model/Mail/MailId.php:25:9
 
     public function equals(MailId $otherId): bool
     {
-        if ($this->id === $otherId->id) {
+        if ($this->id !== $otherId->id) {
             return true;
         }
killedBy: EmailSender\Tests\Domain\Model\Mail\MailIdTest::testIdentify
statusReason: 1) EmailSender\Tests\Domain\Model\Mail\MailIdTest::testIdentify
Failed asserting that true is false.

/home/dev/work/emailsender/tests/unit/Domain/Model/Mail/MailIdTest.php:15

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[NoCoverage] TrueValue
Domain/Model/Mail/MailId.php:26:13
     public function equals(MailId $otherId): bool
     {
         if ($this->id === $otherId->id) {
-            return true;
+            return false;
         }
         return false;
