[Killed] Throw_
Domain/Recipient.php:16:13
     public function __construct(private array $recipient)
     {
         if (empty($recipient)) {
-            throw new InvalidArgumentException("Recipients cannot be empty");
+            new InvalidArgumentException("Recipients cannot be empty");
         }
     }
killedBy: EmailSender\Tests\Domain\RecipientTest::testRecipientCannotBeEmpty
statusReason: 1) EmailSender\Tests\Domain\RecipientTest::testRecipientCannotBeEmpty
Failed asserting that exception of type "OutOfBoundsException" matches expected exception "InvalidArgumentException". Message was: "This recipient rank doesn't exist" at
/home/dev/work/emailsender/src/Domain/Recipient.php:21
/home/dev/work/emailsender/tests/unit/Domain/RecipientTest.php:24
.

FAILURES!
Tests: 3, Assertions: 5, F

[Killed] LogicalNot
Domain/Recipient.php:22:9
 
     public function getRecipientName(int $rank): string
     {
-        if (!isset($this->recipient[$rank])) {
+        if (isset($this->recipient[$rank])) {
             throw new OutOfBoundsException("This recipient rank doesn't exist");
         }
killedBy: EmailSender\Tests\Domain\MailTest::testMail
statusReason: 1) EmailSender\Tests\Domain\RecipientTest::testRecipientWithAnUnexistingRank
Failed asserting that exception of type "Error" matches expected exception "OutOfBoundsException". Message was: "Call to a member function getName() on null" at
/home/dev/work/emailsender/src/Domain/Recipient.php:23
/home/dev/work/emailsender/tests/unit/Domain/RecipientTest.php:32
.

ERRORS!
Tests: 5, Assertions: 7, Error

[Killed] Throw_
Domain/Recipient.php:23:13
     public function getRecipientName(int $rank): string
     {
         if (!isset($this->recipient[$rank])) {
-            throw new OutOfBoundsException("This recipient rank doesn't exist");
+            new OutOfBoundsException("This recipient rank doesn't exist");
         }
 
killedBy: EmailSender\Tests\Domain\RecipientTest::testRecipientWithAnUnexistingRank
statusReason: 1) EmailSender\Tests\Domain\RecipientTest::testRecipientWithAnUnexistingRank
Failed asserting that exception of type "Error" matches expected exception "OutOfBoundsException". Message was: "Call to a member function getName() on null" at
/home/dev/work/emailsender/src/Domain/Recipient.php:23
/home/dev/work/emailsender/tests/unit/Domain/RecipientTest.php:32
.

FAILURES!
Tests: 2, Assertions: 3, Fai
