[Killed] PublicVisibility
Domain/Sender.php:19:5
     /**
      * @return string $sender
      */
-    public function getSenderName(): string
+    protected function getSenderName(): string
     {
         return $this->sender->getName();
killedBy: EmailSender\Tests\Domain\SenderTest::testSender
statusReason: 1) EmailSender\Tests\Domain\SenderTest::testSender
Error: Call to protected method EmailSender\Domain\Sender::getSenderName() from scope EmailSender\Tests\Domain\SenderTest

/home/dev/work/emailsender/tests/unit/Domain/SenderTest.php:17

2) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Sender::getSenderName() from scope EmailSender\Domain\Mail

[Killed] PublicVisibility
Domain/Sender.php:27:5
     /**
      * @return string $sender
      */
-    public function getSenderAddress(): string
+    protected function getSenderAddress(): string
     {
         return $this->sender->getAddress();
killedBy: EmailSender\Tests\Domain\SenderTest::testSender
statusReason: 1) EmailSender\Tests\Domain\SenderTest::testSender
Error: Call to protected method EmailSender\Domain\Sender::getSenderAddress() from scope EmailSender\Tests\Domain\SenderTest

/home/dev/work/emailsender/tests/unit/Domain/SenderTest.php:18

2) EmailSender\Tests\Domain\MailTest::testMail
Error: Call to protected method EmailSender\Domain\Sender::getSenderAddress() from scope EmailSender\Domain\Mail
