[Killed] Throw_
Domain/Subject.php:16:13
     public function getSubject(): string
     {
         if (empty($this->subject)) {
-            throw new InvalidArgumentException("Subject cannot be empty");
+            new InvalidArgumentException("Subject cannot be empty");
         }
         return $this->subject;
killedBy: EmailSender\Tests\Domain\SubjectTest::testSubjectIsNotEmpty
statusReason: 1) EmailSender\Tests\Domain\SubjectTest::testSubjectIsNotEmpty
Failed asserting that exception of type "InvalidArgumentException" is thrown.

FAILURES!
Tests: 2, Assertions: 2, Failures: 1.
