[NoCoverage] Throw_
Infrastructure/Brevo/BrevoSender.php:40:13
             //return ['messageId' => $response->getMessageId()];
             return $this->mail->getResponse();
         } catch (Exception $e) {
-            throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", self::HTTP_ERROR_500, $e);
+            new ErrorMailSenderException("Erreur lors de l'envoi du mail", self::HTTP_ERROR_500, $e);
         }
     }
