5) /home/dev/work/emailsender/src/Domain/Mail.php:54    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function getRecipientData(): array
     {
-        return ['name' => $this->getRecipientName(), 'email' => $this->getRecipientAddress()];
+        return ['name' > $this->getRecipientName(), 'email' => $this->getRecipientAddress()];
     }
     public function getHtmlContent(): string
     {

7) /home/dev/work/emailsender/src/Domain/Mail.php:54    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getRecipientData(): array
     {
-        return ['name' => $this->getRecipientName(), 'email' => $this->getRecipientAddress()];
+        return ['email' => $this->getRecipientAddress()];
     }
     public function getHtmlContent(): string
     {

9) /home/dev/work/emailsender/src/Infrastructure/Brevo/BrevoSender.php:36    [M] DecrementInteger

--- Original
+++ New
@@ @@
             $response = $this->apiInstance->sendTransacEmail($sendSmtpEmail);
             return ['messageId' => $response->getMessageId()];
         } catch (Exception $e) {
-            throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", 500, $e);
+            throw new ErrorMailSenderException("Erreur lors de l'envoi du mail", 499, $e);
         }
     }
 }
