3) /home/dev/work/emailsender/src/Domain/Contact.php:40    [M] Throw_

--- Original
+++ New
@@ @@
     public function getAddress(): string
     {
         if (!$this->isValidEmailAddress($this->address)) {
-            throw new MalformedAddressException("Invalid email address: {$this->address}");
+            new MalformedAddressException("Invalid email address: {$this->address}");
         }
         return $this->address;
     }
 }

5) /home/dev/work/emailsender/src/Domain/Mail.php:39    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function getSenderData(): array
     {
-        return ['name' => $this->getSenderName(), 'email' => $this->getSenderAddress()];
+        return ['name' > $this->getSenderName(), 'email' => $this->getSenderAddress()];
     }
     public function getRecipientName(int $rank): string
     {

9) /home/dev/work/emailsender/src/Domain/Mail.php:57    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function getRecipientData(int $rank): array
     {
-        return ['name' => $this->getRecipientName($rank), 'email' => $this->getRecipientAddress($rank)];
+        return ['name' > $this->getRecipientName($rank), 'email' => $this->getRecipientAddress($rank)];
     }
     public function getHtmlContent(): string
     {

10) /home/dev/work/emailsender/src/Domain/Mail.php:57    [M] ArrayItem

--- Original
+++ New
@@ @@
      */
     public function getRecipientData(int $rank): array
     {
-        return ['name' => $this->getRecipientName($rank), 'email' => $this->getRecipientAddress($rank)];
+        return ['name' => $this->getRecipientName($rank), 'email' > $this->getRecipientAddress($rank)];
     }
     public function getHtmlContent(): string
     {

11) /home/dev/work/emailsender/src/Domain/Mail.php:57    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
      */
     public function getRecipientData(int $rank): array
     {
-        return ['name' => $this->getRecipientName($rank), 'email' => $this->getRecipientAddress($rank)];
+        return ['email' => $this->getRecipientAddress($rank)];
     }
     public function getHtmlContent(): string
     {
